app/controllers/api/todos_controller.rb

  def create
    @todo = Todo.new(todo_params)
    @todo.done = false
    if @todo.save
---
INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "yo"], ["body", "wtf"], ["done", false], ["created_at", "2022-06-09 21:49:57.695135"], ["updated_at", "2022-06-09 21:49:57.695135"]]